Documents/ВводПоказанийПриборовОтопление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводПоказанийПриборовОтопление</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовОтопление</xr:Item>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриборыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоКубов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредварительныйРассчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Тарифы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаПоНорме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифаПоНормеЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифаЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИсточникиПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ИсточникиПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СайтЖКХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаExcel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оператор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктХолоднойВоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОтопление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводПоказанийПриборовОтопление/Forms/ФормаДокумента/Ext/Form/Module.bsl
/////////////////////////////////ПРИ ОТКРЫТИИ ДОКУМЕНТА///////////////////////////
//

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////
//

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере()
	//Объект.ПриборыУчета.Очистить();
	////Получим установленные приборы по данному лицевому счету
	//ПриборыУчета = ПолучитьСписокПриборов(Объект.ЛицевойСчет);
	Объект.Здание = Объект.ЛицевойСчет.Владелец;
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.ПериодНачисления = ТекущаяДата();
	//Для Каждого стр Из ПриборыУчета Цикл
	//    НовСтрока = Объект.ПриборыУчета.Добавить();
	//	НовСтрока.ПриборУчета          = стр.ПриборУчета;
	//	ПоказанияПрибора               = ПоказанияПриборовУчета(стр.ПриборУчета, Объект.ЛицевойСчет);
	//	Если ПоказанияПрибора = Неопределено Тогда
	//		НовСтрока.ПредыдущиеПоказания = стр.Значение;
	//	Иначе
	//	    НовСтрока.ПредыдущиеПоказания = стр.Значение;
	//	КонецЕсли;
	//	НовСтрока.Услуга               = стр.Услуга;
	//	НовСтрока.ВидТарифа            = Перечисления.ВидыТарифов.Общий;
	//	НовСтрока.Источник             = Перечисления.ИсточникиПоказаний.РучнаяОперация;
	//КонецЦикла;
	
	Объект.ПриборыУчета.Очистить();
	
	АдресЛицевыхСчетовВХранилище = Неопределено; ИндивидуальныйВвод = Истина;
	
	Запрос = Новый Запрос;
	Если АдресЛицевыхСчетовВХранилище <> Неопределено Тогда
		ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
		МассивОбъектовУстановки = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	ИначеЕсли ИндивидуальныйВвод Тогда
		МассивОбъектовУстановки = Новый Массив;
		МассивОбъектовУстановки.Добавить(Объект.ЛицевойСчет);
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	Иначе
		ТекстЗапросаДоб = "";
	КонецЕсли;	

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ЛицевойСчет,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета КАК Квартира,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета.Владелец КАК Здание,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент КАК Коэффициент,
		|	ЕСТЬNULL(УслугиВидыТарифов.ВидТарифа, ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)) КАК ВидТарифа,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ДатаСреза, ПриборУчета.Услуга = &Услуга) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.ВидыТарифов КАК УслугиВидыТарифов
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга = УслугиВидыТарифов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА"+ТекстЗапросаДоб;
	
	Запрос.УстановитьПараметр("ДатаСреза", НачалоДня(Объект.Дата));
	Если ЗначениеЗаполнено(Объект.Услуга) Тогда
		Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПриборУчета.Услуга = &Услуга","");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Заполнения = РезультатЗапроса.Выгрузить();
	ТЗ_Заполнения.Колонки.Добавить("Услуга");
	ТЗ_Заполнения.Колонки.Добавить("ПредыдущиеПоказания");
	ТЗ_Заполнения.Колонки.Добавить("Источник");
	Для Каждого стрТЗ Из ТЗ_Заполнения Цикл
		стрТЗ.Услуга = стрТЗ.ПриборУчета.Услуга;
		стрТЗ.Источник = Перечисления.ИсточникиПоказаний.РучнаяОперация;
		стрТЗ.ПредыдущиеПоказания = ПоказанияПриборовУчета(стрТЗ.ПриборУчета, Объект.ЛицевойСчет);
	КонецЦикла;
	
	Объект.ПриборыУчета.Загрузить(ТЗ_Заполнения)
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаТекущиеПоказателиПриИзменении(Элемент)
	ТекСтрока = Элементы.ПриборыУчета.ТекущиеДанные;
	Если ТекСтрока.ТекущиеПоказания < ТекСтрока.ПредыдущиеПоказания Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Текущий показатель меньше или равен предыдущему показателю!'; uk = 'Поточний показник меньше, або дорівнює попередньому показнику!'");
		Сообщение.Сообщить();
	Иначе
	    ТекСтрока.КвоКубов = ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
		ТекСтрока.ПредварительныйРассчет = ПолучитьСуммуПредварительногоРассчета(Объект.ЛицевойСчет, ТекСтрока.Услуга, ТекСтрока.КвоКубов, ТекСтрока.ВидТарифа);
	КонецЕсли;
КонецПроцедуры



//////////////////////////////////////////////////////////////////////////////////
//

&НаСервере
Функция ПолучитьСписокПриборов(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	ПоказанияПриборовУчетаСрезПоследних.Значение,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, ОбъектУстановки = &ОбъектУстановки) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ПО (УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета)";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	Список = Запрос.Выполнить().Выгрузить();

	Возврат Список;
КонецФункции

&НаСервере
Функция ПоказанияПриборовУчета(ПриборУчета, ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	МАКСИМУМ(ПоказанияПриборовУчетаСрезПоследних.Значение) КАК Значение
	    |ИЗ
	    |	РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&НаДату, ПриборУчета = &ПриборУчета) КАК ПоказанияПриборовУчетаСрезПоследних
	    |ГДЕ
	    |	ПоказанияПриборовУчетаСрезПоследних.Отключен = ЛОЖЬ
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета";
    Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	//Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Значение = Выборка.Значение;
	КонецЦикла;
	Возврат Значение;
КонецФункции

&НаСервере
Функция ПолучитьСуммуПредварительногоРассчета(ЛицевойСчет, Услуга, КвоКубов, ВидТарифа)
	Сумма = 0;
	ЗапросТариф = Новый Запрос;
	ЗапросТариф.Текст = 
	    "ВЫБРАТЬ
	    |	ТарифыСрезПоследних.ЗначениеТарифа
	    |ИЗ
	    |	РегистрСведений.Тарифы.СрезПоследних(
	    |			&НаДату,
	    |			Услуга = &Услуга
	    |				И Здание = &Здание
	    |				И ВидТарифа = &ВидТарифа) КАК ТарифыСрезПоследних";
	ЗапросТариф.УстановитьПараметр("НаДату", ТекущаяДата());
	ЗапросТариф.УстановитьПараметр("Услуга", Услуга);
	ЗапросТариф.УстановитьПараметр("Здание", ЛицевойСчет.Владелец);
	ЗапросТариф.УстановитьПараметр("ВидТарифа", Перечисления.ВидыТарифов.Общий);
	Результат = ЗапросТариф.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Тариф = Выборка.ЗначениеТарифа;
		КонецЦикла;
	Иначе
		Сообщить("Тариф не знайдено!");
		Возврат 0;
	КонецЕсли;
	Сумма = Тариф * КвоКубов;
	Возврат Сумма;
КонецФункции
